from datetime import date, timedelta

today = date.today().strftime("%d.%m.%Y")
tomorrow = (date.today() + timedelta(days=1)).strftime("%d.%m.%Y")

class Data:

    TEXT_FAQ_ANSWER_0 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'

    TEXT_FAQ_ANSWER_1 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'

    TEXT_FAQ_ANSWER_2 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'

    TEXT_FAQ_ANSWER_3 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'

    TEXT_FAQ_ANSWER_4 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'

    TEXT_FAQ_ANSWER_5 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'

    TEXT_FAQ_ANSWER_6 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'

    TEXT_FAQ_ANSWER_7 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

    TEST_ORDER_1 = {
        "name": "Дмитрий",
        "surname": "Шадриков",
        "address": "Москва",
        "subway_station": "Улица Скобелевская",
        "phone_number": "+7916000000",
        "date": today,
        "rental_period": "сутки",
        "color": "black",
        "comment": "Хорошего дня"
    }

    TEST_ORDER_2 = {
            "name": "Александр",
            "surname": "Пушкин",
            "address": "Пушкино",
            "subway_station": "Пушкинская",
            "phone_number": "+79101112233",
            "date": tomorrow,
            "rental_period": "семеро суток",
            "color": "grey"
        }
